app/controllers/images_controller.rb

  def create
    @image = Image.new(image_params)
    @image.user = current_user

    respond_to do |format|
      if @image.save
---
INSERT INTO "images" ("name", "picture", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Test image"], ["picture", "1_0xUiJ0naaeQheGusKboMGQ.jpeg"], ["user_id", 13], ["created_at", "2022-09-30 07:51:09.780206"], ["updated_at", "2022-09-30 07:51:09.780206"]]

  def my_images
    @images = Image.where(user_id: current_user.id)
---
SELECT "images".* FROM "images" WHERE "images"."user_id" = ? LIMIT ?  [["user_id", 13], ["LIMIT", 1]]