app/controllers/registrations_controller.rb

INSERT INTO "users" ("email", "encrypted_password", "reset_password_token", "reset_password_sent_at", "remember_created_at", "confirmation_token", "confirmed_at", "confirmation_sent_at", "unconfirmed_email", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
INSERT INTO "payments" ("email", "token", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["email", "slepenkov.nii@yandex.by"], ["token", "[FILTERED]"], ["user_id", 8], ["created_at", "2022-09-29 11:13:23.936841"], ["updated_at", "2022-09-29 11:13:23.936841"]]
---
  def create
    build_resource(sign_up_params)

    resource.class.transaction do
      resource.save
      yield resource if block_given?
      if resource.persisted?
        @payment = Payment.new({email: params['user']['email'],
                                token: params['payment']['payment_intent'],
                                user_id: resource.id})
        flash[:error] = 'Please check registration errors' unless @payment.valid?

        begin
          @payment.save